Tekla.Structures.ModelInternal.RebarStrip
Represents a strip that can modify the characteristics of rebars that pass through it.

Tekla.Structures.ModelInternal.RebarStrip.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarStrip class.

Tekla.Structures.ModelInternal.RebarStrip.Insert
Inserts the RebarStrip into the model database.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarStrip.Modify
Modifies the existing RebarStrip in the model database to match the current one.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarStrip.Delete
Deletes the RebarStrip from the model database.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarStrip.Select
Selects the RebarStrip from the model database. The identifier must be set.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarStrip.CloneStrip
Clones the rebar strip.
Returns: The cloned rebar strip.

Tekla.Structures.ModelInternal.RebarStrip.SelectInstance
The select instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarStrip.ModifyInstance
The modify instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarStrip.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarStrip.ToStruct(Tekla.Structures.ModelInternal.dotRebarStrip_t@)
The to struct.
dotStrip: The dot strip.

Tekla.Structures.ModelInternal.RebarStrip.FromStruct(Tekla.Structures.ModelInternal.dotRebarStrip_t@)
The from struct.
dotStrip: The dot strip.

Tekla.Structures.ModelInternal.RebarStrip.Father
Gets or sets the RebarSet to which the strip belongs.

Tekla.Structures.ModelInternal.RebarStrip.Curve
Gets or sets the geometric curve of the strip.

Tekla.Structures.ModelInternal.RebarStrip.ApplyOrderNumber
Gets or sets the 'apply' order number of the strip.